app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(post_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "History "], ["room_number", 202], ["created_at", "2020-04-06 14:36:02.035251"], ["updated_at", "2020-04-06 14:36:02.035251"]]

    def update
        @school_class = find_class
        @school_class = SchoolClass.update(post_params)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "France"], ["updated_at", "2020-04-06 14:53:03.709258"], ["id", 9]]

    def find_class
        SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]